---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeRoofFromVerticalFace
source: html/baea59f6-4ace-8f15-4a1a-5037ac7d1b33.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeRoofFromVerticalFace Property

Can't make roof from vertical face.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeRoofFromVerticalFace { get; }
```